tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "arm-none-eabi-gcc"
brew "bat"
brew "codex"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "lazygit"
brew "libyaml"
brew "mise"
brew "poppler"
brew "tree"
brew "uv"
brew "zellij"
brew "zoxide"
brew "osx-cross/avr/avr-gcc@9"
cask "claude-code"
cask "font-hack-nerd-font"
cask "ghostty"
vscode "42crunch.vscode-openapi"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amodio.restore-editors"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "dakara.transformer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidpallinder.rails-test-runner"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.vscode-mysql"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "jbockle.jbockle-format-files"
vscode "jianbingfang.dupchecker"
vscode "koichisasada.vscode-rdbg"
vscode "ldrner.rspec-snippets-vscode"
vscode "marp-team.marp-vscode"
vscode "mateuszdrewniak.ruby-test-runner"
vscode "mhutchie.git-graph"
vscode "misogi.ruby-rubocop"
vscode "mitchdenny.ecdc"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rubocop.vscode-rubocop"
vscode "ruby-syntax-tree.vscode-syntax-tree"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shadowenv"
vscode "sleistner.vscode-fileutils"
vscode "sorbet.sorbet-vscode-extension"
vscode "thadeu.vscode-run-rspec-file"
vscode "wallabyjs.console-ninja"
vscode "wmaurer.change-case"
vscode "zainchen.json"
cargo "superbook-pdf"
